Documents/Партия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>Партия</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаРасчетовСКомитентом</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДанныеПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПервичныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРегистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР_ДополнительноеСоглашение</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейКнигиПокупок</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеЗарплатыВБухучете</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОРасхожденияхПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.СправкиНДФЛДляПередачиВНалоговыйОрган</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОРасхождениях</v8:Type>
						<v8:Type>cfg:DocumentRef.РаспределениеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупПредметовЛизинга</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОператораСистемыПлатон</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_АктСнятияПоказанийСчетчика</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеМатериаловИзЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыдачаДенежныхДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияОплатыОсновныхСредствДляУСН</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаМатериаловВЭксплуатацию</v8:Type>
						<v8:Type>cfg:DocumentRef.ТаможеннаяДекларацияЭкспорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_ПланированиеЗатратНаЭксплуатацию</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_СчетНаАренду</v8:Type>
						<v8:Type>cfg:DocumentRef.ДепонированиеЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПеней</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_ЗаявкаНаОбслуживание</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_ВводПараметровЭксплуатацииОбъектов</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.АктСверкиВзаиморасчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеДепонированнойЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияБух</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьНачислениеЗарплатыРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ПутевойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаЗадолженностиНаФакторинг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеЗарплатыВУчете</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_ВыполнениеРаботПоОбслуживанию</v8:Type>
						<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОСВАренду</v8:Type>
						<v8:Type>cfg:DocumentRef.МодернизацияОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаТоваровВРознице</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_ИзменениеСтатусовОбъектов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияСБилетом</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_РасторжениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.Отпуск</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПлатежнойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьСписаниеДепонентовВДоходыОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ТребованиеНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.БольничныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодготовкаКПередачеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_УстановкаЦенНаАренду</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьДепонированиеОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОборудованияВМонтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.РегламентнаяОперация</v8:Type>
						<v8:Type>cfg:DocumentRef.ПерерасчетНДФЛ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОСОтАрендатора</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВЛизинг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходыПредпринимателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВосстановлениеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеНулевойСтавкиНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаписьКнигиУчетаДоходовИРасходовИП</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияОплатыОсновныхСредствДляИП</v8:Type>
						<v8:Type>cfg:DocumentRef.РозничнаяПродажа</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_НачислениеАренднойПлаты</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_ЗаключениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейРаздела7ДекларацииНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеОплатыНДСВБюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеЗаписейКнигиПродаж</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_НачислениеПени</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьОтражениеЗарплатыВУчете</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияНЗП</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНачисленияНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_ПланируемыеПоступленияДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПартияМатериаловВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеНДСКВычету</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходыНаОнлайнКассыУменьшающиеНалоги</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияТоваровНаСкладе</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьРасчетЕСН</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияОтгруженныхТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаписьКУДиР</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратМатериаловИзЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеНДСпоСМРхозспособом</v8:Type>
						<v8:Type>cfg:DocumentRef.ВосстановлениеНДСПоОбъектамНедвижимости</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_ЗакрытиеЗаявкиНаОбслуживание</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_АктПриемаВозвратаАрендуемогоПомещения</v8:Type>
						<v8:Type>cfg:DocumentRef.Партия</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_АктПриемаПередачиПомещенияВАренду</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Documents/Партия/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	РежимыОтбораДокументов = Новый Структура;
	РежимыОтбораДокументов.Вставить("ПоРеквизитам", Перечисления.РежимОтбораДокументов.ПоРеквизитам);
	РежимыОтбораДокументов.Вставить("ПоОстаткам", Перечисления.РежимОтбораДокументов.ПоОстаткам);
	РежимыОтбораДокументов.Вставить("ПоОборотам", Перечисления.РежимОтбораДокументов.ПоОборотам);
	
	Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	
	НаСчетеВедетсяУчетПоСкладам      = БухгалтерскийУчет.ВедетсяУчетПоСкладам(СчетУчета);
	ИспользоватьНесколькоСкладов     = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоСкладовБухгалтерскийУчет");
	ИспользоватьНесколькоОрганизаций = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизацийБухгалтерскийУчет");
	
	Если Параметры.Свойство("ПараметрыОбъекта") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ПараметрыОбъекта);
		Если ТипЗнч(Параметры.ПараметрыОбъекта.ТипыДокументов) = Тип("Строка") Тогда
			ТипыДокументов = Вычислить(Параметры.ПараметрыОбъекта.ТипыДокументов);
		Иначе
			ТипыДокументов = Параметры.ПараметрыОбъекта.ТипыДокументов;
		КонецЕсли;
		
		// Если в списке документов нет партии, то и добавлять ее не нужно
		Элементы.СписокДобавить.Видимость = ТипыДокументов.СодержитТип(Тип("ДокументСсылка.Партия"));
	КонецЕсли;
	
	// КонПериода
	Если НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		КонецПериода = КонецМесяца(ТекущаяДатаСеанса());
	КонецЕсли;

	// НачПериода
	Если НЕ ЗначениеЗаполнено(НачалоПериода) Тогда
		НачалоПериода = НачалоМесяца(КонецПериода);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РежимОтбораДокументов) Тогда
		РежимОтбораДокументов = Перечисления.РежимОтбораДокументов.ПоРеквизитам;
	КонецЕсли;
	
	Если СчетУчета = Неопределено Тогда
		СчетУчета = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипыДокументов) тогда
		ТипыДокументов = Новый ОписаниеТипов("ДокументСсылка.Партия");
	КонецЕсли;
	
	Если ФормироватьСписокПриОткрытии Тогда
		СформироватьСервер();
	КонецЕсли;
	
	УправлениеФормой(ЭтаФорма);
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Параметры.Свойство("РежимОтбораДокументов") Тогда
		Настройки.Очистить();
	КонецЕсли;
	
	// Если в сохраненных настройках есть признак формирования
	// при открытии, то сформируем список.
	Если (Настройки["ФормироватьСписокПриОткрытии"] = Истина) 
		И НЕ ФормироватьСписокПриОткрытии Тогда
		
		СохраненныйРежимОтбораДокументов = Настройки["РежимОтбораДокументов"];
		Если ЗначениеЗаполнено(СохраненныйРежимОтбораДокументов) Тогда
			РежимОтбораДокументов = СохраненныйРежимОтбораДокументов;
		КонецЕсли;
		СформироватьСервер();
		
		УправлениеФормой(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	Если НЕ СохранятьРежимОтбораДокументов Тогда
		Настройки.Удалить("РежимОтбораДокументов");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	ОповеститьОВыборе(НовыйОбъект);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РежимОтбораПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтбораОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаПриИзменении(Элемент)
	
	НаСчетеВедетсяУчетПоСкладам = ВедетсяУчетПоСкладам(СчетУчета);
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда 
		СтандартнаяОбработка = Ложь;
		Возврат; 
	КонецЕсли;

	ТекущийДокумент = ТекущиеДанные.Документ;
	Если НЕ ЗначениеЗаполнено(ТекущийДокумент) Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;

	ОповеститьОВыборе(ТекущийДокумент);

КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Дата", КонецПериода);
	ЗначенияЗаполнения.Вставить("Организация", Организация);
	
	ОткрытьФорму("Документ.Партия.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)

	Отказ = Истина;

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат; 
	КонецЕсли;

	ТекущийДокумент = ТекущиеДанные.Документ;
	Если НЕ ЗначениеЗаполнено(ТекущийДокумент) Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение( , ТекущийДокумент);

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьСервер();
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.Организация.Видимость = Форма.ИспользоватьНесколькоОрганизаций;
	
	Если НЕ Форма.ИспользоватьНесколькоСкладов Тогда
		Элементы.Склад.Видимость = Ложь;
	ИначеЕсли Форма.НаСчетеВедетсяУчетПоСкладам Тогда
		Элементы.Склад.Доступность = Истина;
	Иначе
		Элементы.Склад.Доступность     = Форма.Склад <> Неопределено;
	КонецЕсли;
	
	Элементы.СчетУчета.Доступность = (Форма.РежимОтбораДокументов <> Форма.РежимыОтбораДокументов.ПоРеквизитам);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОграничениеСпискаДокументовПоТипу(Результат, ТипыДокументов)

	СтрокиКУдалению = Новый Массив();
	Результат.Колонки.Добавить("Сумма");
	Результат.Колонки.Добавить("Дата");
	Результат.Колонки.Добавить("Номер");
	Результат.Колонки.Добавить("ДатаВходящегоДокумента");
	Результат.Колонки.Добавить("НомерВходящегоДокумента");
	Результат.Колонки.Добавить("Проведен");
	Результат.Колонки.Добавить("ПометкаУдаления");
	Результат.Колонки.Добавить("СостояниеДокумента");
	Результат.Колонки.Добавить("ВидДокумента");
	Результат.Колонки.Добавить("ВидОперации");
	Результат.Колонки.Добавить("Валюта");
	Результат.Колонки.Добавить("Ответственный");
	
	ТаблицаТипов = Новый ТаблицаЗначений;
	ТаблицаТипов.Колонки.Добавить("ТипДокумента");
	ТаблицаТипов.Колонки.Добавить("ВидДокумента");
	ТаблицаТипов.Колонки.Добавить("НомерПараметра");
	ТаблицаТипов.Колонки.Добавить("МассивДокументов");
	ТаблицаТипов.Индексы.Добавить("ТипДокумента");
	
	НомерПараметра = 0;
	
	РеквизитыДокумента = Новый Структура;
	РеквизитыДокумента.Вставить("СуммаДокумента",  "0");
	РеквизитыДокумента.Вставить("ВидОперации",     "НЕОПРЕДЕЛЕНО");
	РеквизитыДокумента.Вставить("ВалютаДокумента", "НЕОПРЕДЕЛЕНО");
	РеквизитыДокумента.Вставить("Ответственный",   "НЕОПРЕДЕЛЕНО");
	
	ЧастиЗапроса = Новый Массив;
	
	ШаблонЗапросаПоДокумента = 
	"ВЫБРАТЬ
	|	ДокументПартии.Ссылка КАК Ссылка,
	|	ДокументПартии.Дата КАК Дата,
	|	ДокументПартии.Номер КАК Номер,
	|	ДокументПартии.Проведен КАК Проведен,
	|	ДокументПартии.ПометкаУдаления КАК ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА ДокументПартии.ПометкаУдаления
	|			ТОГДА 2
	|		КОГДА ДокументПартии.Проведен
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СостояниеДокумента,
	|	&СуммаДокумента КАК Сумма,
	|	&ВидОперации КАК ВидОперации,
	|	&ВалютаДокумента КАК ВалютаДокумента,
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.Дата, НЕОПРЕДЕЛЕНО) КАК ДатаВходящегоДокумента,
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.Номер, НЕОПРЕДЕЛЕНО) КАК НомерВходящегоДокумента,
	|	&Ответственный КАК Ответственный
	|ИЗ
	|	Документ.Партия КАК ДокументПартии
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО ДокументПартии.Ссылка = ДанныеПервичныхДокументов.Документ
	|			И ДокументПартии.Организация = ДанныеПервичныхДокументов.Организация
	|ГДЕ
	|	ДокументПартии.Ссылка В(&СписокДокументов)";

	Для каждого СтрокаВыборки Из Результат Цикл

		Если НЕ ТипыДокументов.СодержитТип(ТипЗнч(СтрокаВыборки.Документ)) ИЛИ НЕ ЗначениеЗаполнено(СтрокаВыборки.Документ) Тогда
			СтрокиКУдалению.Добавить(СтрокаВыборки);
		Иначе
			ТипДокумента  	= ТипЗнч(СтрокаВыборки.Документ);
			СтрокаТипов 	= ТаблицаТипов.Найти(ТипДокумента, "ТипДокумента");	
			Если СтрокаТипов <> Неопределено Тогда
				СтрокаТипов.МассивДокументов.Добавить(СтрокаВыборки.Документ);
			Иначе
				МД_Документа                     = Метаданные.НайтиПоТипу(ТипДокумента);
				
				НомерПараметра 					 = НомерПараметра + 1;
				
				СтрокаТипов 					 = ТаблицаТипов.Добавить();
				СтрокаТипов.ТипДокумента		 = ТипДокумента;
				СтрокаТипов.НомерПараметра		 = НомерПараметра;
				СтрокаТипов.ВидДокумента		 = МД_Документа.Представление();
				СтрокаТипов.МассивДокументов	 = Новый Массив;
				СтрокаТипов.МассивДокументов.Добавить(СтрокаВыборки.Документ);
				
				ТекстЗапросаПоДокументу = СтрЗаменить(ШаблонЗапросаПоДокумента, "Документ.Партия", "Документ."+МД_Документа.Имя);
				ТекстЗапросаПоДокументу = СтрЗаменить(ТекстЗапросаПоДокументу,  "&СписокДокументов", "&СписокДокументов" + Формат(НомерПараметра, "ЧГ="));
				
				Если ЧастиЗапроса.Количество() = 0 Тогда
					ТекстЗапросаПоДокументу = СтрЗаменить(ТекстЗапросаПоДокументу, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
				КонецЕсли; 
				
				Для каждого РеквизитДокумента Из РеквизитыДокумента Цикл
					Если ОбщегоНазначения.ЕстьРеквизитОбъекта(РеквизитДокумента.Ключ, МД_Документа) Тогда
						ТекстЗапросаПоДокументу = СтрЗаменить(ТекстЗапросаПоДокументу, "&"+РеквизитДокумента.Ключ, "ДокументПартии."+РеквизитДокумента.Ключ);
					Иначе
						ТекстЗапросаПоДокументу = СтрЗаменить(ТекстЗапросаПоДокументу, "&"+РеквизитДокумента.Ключ, РеквизитДокумента.Значение);
					КонецЕсли; 
				КонецЦикла; 
				
				ЧастиЗапроса.Добавить(ТекстЗапросаПоДокументу);
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	Для Каждого СтрокаВыборки Из СтрокиКУдалению Цикл
		Результат.Удалить(СтрокаВыборки);
	КонецЦикла;
	
	Если Результат.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = СтрСоединить(ЧастиЗапроса, Символы.ПС+"ОБЪЕДИНИТЬ ВСЕ"+Символы.ПС);
	
	// Установим параметры запроса 
	Для Каждого СтрокаТаблицы Из ТаблицаТипов Цикл
		Запрос.УстановитьПараметр("СписокДокументов" + Формат(СтрокаТаблицы.НомерПараметра, "ЧГ="), СтрокаТаблицы.МассивДокументов);
	КонецЦикла;
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	ТаблицаДокументов.Индексы.Добавить("Ссылка");
	
	Для каждого СтрокаВыборки Из Результат Цикл

		СтрокаДокумента = ТаблицаДокументов.Найти(СтрокаВыборки.Документ, "Ссылка");
		Если СтрокаДокумента <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаВыборки, СтрокаДокумента);
		КонецЕсли;

		СтрокаТипов = ТаблицаТипов.Найти(ТипЗнч(СтрокаВыборки.Документ), "ТипДокумента");
		Если СтрокаТипов <> Неопределено Тогда
			СтрокаВыборки.ВидДокумента		 = СтрокаТипов.ВидДокумента;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	// Организация

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Организация");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"РежимОтбораДокументов", ВидСравненияКомпоновкиДанных.НеРавно, Перечисления.РежимОтбораДокументов.ПоРеквизитам);

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Организация", ВидСравненияКомпоновкиДанных.НеЗаполнено);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);


	// СчетУчета

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СчетУчета");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"РежимОтбораДокументов", ВидСравненияКомпоновкиДанных.НеРавно, Перечисления.РежимОтбораДокументов.ПоРеквизитам);

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СчетУчета", ВидСравненияКомпоновкиДанных.НеЗаполнено);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	
	// СписокОстаток

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СписокОстаток");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"РежимОтбораДокументов", ВидСравненияКомпоновкиДанных.НеРавно, Перечисления.РежимОтбораДокументов.ПоОстаткам);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// СписокКоличествоОстаток

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СписокКоличествоОстаток");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"РежимОтбораДокументов", ВидСравненияКомпоновкиДанных.НеРавно, Перечисления.РежимОтбораДокументов.ПоОстаткам);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// СписокЦена

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СписокЦена");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"РежимОтбораДокументов", ВидСравненияКомпоновкиДанных.НеРавно, Перечисления.РежимОтбораДокументов.ПоОстаткам);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	// СписокСумма

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СписокСумма");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"РежимОтбораДокументов", ВидСравненияКомпоновкиДанных.НеРавно, Перечисления.РежимОтбораДокументов.ПоОстаткам);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВедетсяУчетПоСкладам(СчетУчета)
	
	БухгалтерскийУчет.ВедетсяСуммовойУчетПоСкладам(СчетУчета);
	
КонецФункции

#Область ПолучениеДанныхСписка

&НаСервере
Процедура СформироватьСервер()
	Перем ТаблицаИсточник;
	
	СтруктураОтбора = Новый Структура;
	Если ПомеченныеНаУдаление.СкрыватьПомеченныеНаУдаление() Тогда
		СтруктураОтбора.Вставить("ПометкаУдаления", Ложь);
	КонецЕсли;
	
	Если РежимОтбораДокументов = Перечисления.РежимОтбораДокументов.ПоРеквизитам Тогда
		
		СтруктураОтбора.Вставить("НачПериода",     НачалоПериода);
		СтруктураОтбора.Вставить("КонПериода",     КонецПериода);
		СтруктураОтбора.Вставить("Организация",    Организация);
		СтруктураОтбора.Вставить("Контрагент",     Контрагент);
		СтруктураОтбора.Вставить("ТипыДокументов", ТипыДокументов);
	
		ТаблицаИсточник = ПолучитьДанныеСпискаПоРеквизитам(СтруктураОтбора);
	ИначеЕсли РежимОтбораДокументов = Перечисления.РежимОтбораДокументов.ПоОборотам Тогда
		
		СтруктураОтбора.Вставить("НачПериода",     НачалоПериода);
		СтруктураОтбора.Вставить("КонПериода",     КонецПериода);
		СтруктураОтбора.Вставить("Организация",    Организация);
		СтруктураОтбора.Вставить("Номенклатура",   Номенклатура);
		СтруктураОтбора.Вставить("Склад",          Склад);
		СтруктураОтбора.Вставить("СчетУчета",      СчетУчета);
		СтруктураОтбора.Вставить("ТипыДокументов", ТипыДокументов);
		
		ТаблицаИсточник = ПолучитьДанныеСпискаПоОборотам(СтруктураОтбора);
	ИначеЕсли РежимОтбораДокументов = Перечисления.РежимОтбораДокументов.ПоОстаткам Тогда
		
		СтруктураОтбора.Вставить("НачПериода",     НачалоПериода);
		СтруктураОтбора.Вставить("КонПериода",     КонецПериода);
		СтруктураОтбора.Вставить("Организация",    Организация);
		СтруктураОтбора.Вставить("Номенклатура",   Номенклатура);
		СтруктураОтбора.Вставить("Склад",          Склад);
		СтруктураОтбора.Вставить("СчетУчета",      СчетУчета);
		СтруктураОтбора.Вставить("ТипыДокументов", ТипыДокументов);
		
		ТаблицаИсточник = ПолучитьДанныеСпискаПоОстаткам(СтруктураОтбора);
	КонецЕсли;
	
	Список.Очистить();
	Если ТаблицаИсточник <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаИсточник, Список);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеСпискаПоРеквизитам(СтруктураОтбора)
	
	НачПериода      = СтруктураОтбора["НачПериода"];
	КонПериода      = СтруктураОтбора["КонПериода"];
	Организация     = СтруктураОтбора["Организация"];
	Контрагент      = СтруктураОтбора["Контрагент"];
	ОграничениеТипа = СтруктураОтбора["ТипыДокументов"];
	
	Запрос = Новый Запрос;

	// Определим типы документов, которые могут являться партиями и по ним по всем сформируем текст запроса
	ТипыСубконтоПартии = ОграничениеТипа.Типы();
	
	СписокУсловий = Новый Массив;
	СписокУсловий.Добавить("ДокументПартии.Дата >= &НачПериода");
	
	Если ЗначениеЗаполнено(КонПериода) Тогда
		СписокУсловий.Добавить("ДокументПартии.Дата <= &КонПериода");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		СписокУсловий.Добавить("ДокументПартии.Организация = &Организация");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		СписокУсловий.Добавить("ДокументПартии.Контрагент = &Контрагент");
	КонецЕсли;
	
	Если СтруктураОтбора.Свойство("ПометкаУдаления") Тогда
		СписокУсловий.Добавить("ДокументПартии.ПометкаУдаления = "
			+ ?(СтруктураОтбора.ПометкаУдаления, "ИСТИНА", "ЛОЖЬ"));
	КонецЕсли;
	
	РеквизитыДокумента = Новый Структура;
	РеквизитыДокумента.Вставить("СуммаДокумента",  "0");
	РеквизитыДокумента.Вставить("ВидОперации",     "НЕОПРЕДЕЛЕНО");
	РеквизитыДокумента.Вставить("ВалютаДокумента", "НЕОПРЕДЕЛЕНО");
	РеквизитыДокумента.Вставить("Ответственный",   "НЕОПРЕДЕЛЕНО");
	
	ЧастиЗапроса = Новый Массив;
	
	ШаблонЗапросаПоДокументу = 
	"ВЫБРАТЬ
	|	ДокументПартии.Ссылка КАК Документ,
	|	ДокументПартии.Дата КАК Дата,
	|	ДокументПартии.Номер КАК Номер,
	|	ДокументПартии.Проведен КАК Проведен,
	|	ДокументПартии.ПометкаУдаления КАК ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА ДокументПартии.ПометкаУдаления
	|			ТОГДА 2
	|		КОГДА ДокументПартии.Проведен
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СостояниеДокумента,
	|	""&ВидДокумента"" КАК ВидДокумента,
	|	&СуммаДокумента КАК Сумма,
	|	&ВидОперации КАК ВидОперации,
	|	&ВалютаДокумента КАК Валюта,
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.Дата, НЕОПРЕДЕЛЕНО) КАК ДатаВходящегоДокумента,
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.Номер, НЕОПРЕДЕЛЕНО) КАК НомерВходящегоДокумента,
	|	&Ответственный КАК Ответственный
	|ИЗ
	|	Документ.Партия КАК ДокументПартии
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО ДокументПартии.Ссылка = ДанныеПервичныхДокументов.Документ
	|			И ДокументПартии.Организация = ДанныеПервичныхДокументов.Организация
	|ГДЕ
	|	&Условия";
	
	ШаблонЗапросаПоДокументу = СтрЗаменить(ШаблонЗапросаПоДокументу, "&Условия", СтрСоединить(СписокУсловий, " И "));

	Для Каждого ТипДокумента Из ТипыСубконтоПартии Цикл

		МД_Документа = Метаданные.НайтиПоТипу(ТипДокумента);
		Если ЗначениеЗаполнено(Организация) 
			И МД_Документа.Реквизиты.Найти("Организация") = Неопределено Тогда
			// В документе нет поля "Организация". Отбор по документу не производим.
			Продолжить;
		КонецЕсли;
	
		Если ЗначениеЗаполнено(Контрагент) 
			И  МД_Документа.Реквизиты.Найти("Контрагент") = Неопределено Тогда
			// В документе нет поля "Контрагент".  Отбор по документу не производим.
			Продолжить;
		КонецЕсли;

		ВидДокумента = СтрЗаменить(МД_Документа.Представление(), """", """""");
		
		ТекстЗапросаПоДокументу = СтрЗаменить(ШаблонЗапросаПоДокументу, "Документ.Партия", "Документ." + МД_Документа.Имя);
		ТекстЗапросаПоДокументу = СтрЗаменить(ТекстЗапросаПоДокументу, "&ВидДокумента", ВидДокумента);
		
		Если ЧастиЗапроса.Количество() = 0 Тогда
			ТекстЗапросаПоДокументу = СтрЗаменить(ТекстЗапросаПоДокументу, "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
			ТекстЗапросаПоДокументу = СтрЗаменить(ТекстЗапросаПоДокументу, "ИЗ", "ПОМЕСТИТЬ ВТ_ТаблицаПартий"+Символы.ПС+"ИЗ");
		КонецЕсли; 
		
		Для каждого РеквизитДокумента Из РеквизитыДокумента Цикл
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта(РеквизитДокумента.Ключ, МД_Документа) Тогда
				ТекстЗапросаПоДокументу = СтрЗаменить(ТекстЗапросаПоДокументу, "&"+РеквизитДокумента.Ключ, "ДокументПартии."+РеквизитДокумента.Ключ);
			Иначе
				ТекстЗапросаПоДокументу = СтрЗаменить(ТекстЗапросаПоДокументу, "&"+РеквизитДокумента.Ключ, РеквизитДокумента.Значение);
			КонецЕсли; 
		КонецЦикла; 
		
		ЧастиЗапроса.Добавить(ТекстЗапросаПоДокументу);
	КонецЦикла;

	КонецЗапроса = 
	";
	|
	|ВЫБРАТЬ
	|	ТаблицаПартий.Документ,
	|	ТаблицаПартий.Дата,
	|	ТаблицаПартий.Номер,
	|	ТаблицаПартий.Проведен,
	|	ТаблицаПартий.ПометкаУдаления,
	|	ТаблицаПартий.СостояниеДокумента КАК СостояниеДокумента,
	|	ТаблицаПартий.ВидДокумента КАК ВидДокумента, 
	|	ТаблицаПартий.Сумма КАК Сумма,
	|	ТаблицаПартий.ВидОперации КАК ВидОперации,
	|	ТаблицаПартий.Валюта КАК Валюта,
	|	ТаблицаПартий.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	ТаблицаПартий.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	ТаблицаПартий.Ответственный КАК Ответственный
	|ИЗ
	|	ВТ_ТаблицаПартий КАК ТаблицаПартий
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаПартий.Документ
	|АВТОУПОРЯДОЧИВАНИЕ";

	Запрос.Текст = СтрСоединить(ЧастиЗапроса, Символы.ПС+"ОБЪЕДИНИТЬ ВСЕ"+Символы.ПС) + КонецЗапроса;
	
	Запрос.УстановитьПараметр("НачПериода",  НачалоДня(НачПериода));
	Запрос.УстановитьПараметр("КонПериода",  КонПериода);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент",  Контрагент);

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеСпискаПоОборотам(СтруктураОтбора)
	
	НачПериода      = СтруктураОтбора["НачПериода"];
	КонПериода      = СтруктураОтбора["КонПериода"];
	Организация     = СтруктураОтбора["Организация"];
	Номенклатура    = СтруктураОтбора["Номенклатура"];
	Склад           = СтруктураОтбора["Склад"];
	СчетУчета       = СтруктураОтбора["СчетУчета"];
	ОграничениеТипа = СтруктураОтбора["ТипыДокументов"];
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачПериода",   НачалоДня(НачПериода));
	Запрос.УстановитьПараметр("КонПериода",   КонПериода);
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);

	УсловиеВТекстеЗапроса = ?(НЕ ЗначениеЗаполнено(Организация), "Субконто1 = &Номенклатура", "Субконто1 = &Номенклатура И Организация = &Организация");
	
	// Если указан счет учета, то необходимо отобрать партии по счету учета
	Если ЗначениеЗаполнено(СчетУчета) Тогда
		Запрос.УстановитьПараметр("Счет", СчетУчета);
		УсловиеВыбораСчетаВТекстеЗапроса = "Счет В (&Счет)";
	Иначе
		УсловиеВыбораСчетаВТекстеЗапроса = "";
	КонецЕсли;
	
	НаСчетеВедетсяУчетПоСкладам = ЗначениеЗаполнено(СчетУчета) И БухгалтерскийУчет.ВедетсяУчетПоСкладам(СчетУчета);

	// Если указан склад, то необходимо отобрать партии по складу
	Если ЗначениеЗаполнено(Склад) И НаСчетеВедетсяУчетПоСкладам Тогда
		Запрос.УстановитьПараметр("Склад", Склад);
		Видысубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
		УсловиеВТекстеЗапроса = УсловиеВТекстеЗапроса + " И Субконто3 = &Склад";
	КонецЕсли;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновнойОбороты.Субконто2.Ссылка КАК Документ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачПериода, &КонПериода, , " + УсловиеВыбораСчетаВТекстеЗапроса + ", &ВидыСубконто, " + УсловиеВТекстеЗапроса + ", , ) КАК ОсновнойОбороты";
	Результат = Запрос.Выполнить().Выгрузить();

	ОграничениеСпискаДокументовПоТипу(Результат, ОграничениеТипа);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеСпискаПоОстаткам(СтруктураОтбора)

	НачПериода      = СтруктураОтбора["НачПериода"];
	КонПериода      = СтруктураОтбора["КонПериода"];
	Организация     = СтруктураОтбора["Организация"];
	Номенклатура    = СтруктураОтбора["Номенклатура"];
	Склад           = СтруктураОтбора["Склад"];
	СчетУчета       = СтруктураОтбора["СчетУчета"];
	ОграничениеТипа = СтруктураОтбора["ТипыДокументов"];
	
	ВидыСубконто = Новый Массив;
	Видысубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	Видысубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КонПериода",   КонПериода);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);

	УсловиеВТекстеЗапроса = ?(НЕ ЗначениеЗаполнено(Организация), "Субконто1 = &Номенклатура", "Субконто1 = &Номенклатура И Организация = &Организация");
	
	// Если указан склад, то необходимо отобрать партии по складу
	Если ЗначениеЗаполнено(СчетУчета) Тогда
		Запрос.УстановитьПараметр("Счет", БухгалтерскийУчетПовтИсп.СчетаВИерархии(СчетУчета));
		УсловиеВыбораСчетаВТекстеЗапроса = "Счет В (&Счет)";
	Иначе 
		УсловиеВыбораСчетаВТекстеЗапроса = "";
	КонецЕсли;
	
	НаСчетеВедетсяУчетПоСкладам = ЗначениеЗаполнено(СчетУчета) И БухгалтерскийУчет.ВедетсяУчетПоСкладам(СчетУчета);

	// Если указан склад, то необходимо отобрать партии по складу
	Если ЗначениеЗаполнено(Склад) И НаСчетеВедетсяУчетПоСкладам Тогда
		Запрос.УстановитьПараметр("Склад", Склад);
		Видысубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
		УсловиеВТекстеЗапроса = УсловиеВТекстеЗапроса + " И Субконто3 = &Склад";
	КонецЕсли;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновнойОстатки.Субконто2 КАК Документ,
	|	ОсновнойОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ОсновнойОстатки.СуммаОстаток КАК Остаток,
	|	ВЫБОР КОГДА	ОсновнойОстатки.КоличествоОстаток > 0
	|	ТОГДА ОсновнойОстатки.СуммаОстаток / ОсновнойОстатки.КоличествоОстаток
	|	ИНАЧЕ 0
	|	КОНЕЦ КАК Цена
	|ИЗ  
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонПериода, "+ УсловиеВыбораСчетаВТекстеЗапроса + ", &ВидыСубконто, " + УсловиеВТекстеЗапроса + ") КАК ОсновнойОстатки";
	
	Результат = Запрос.Выполнить().Выгрузить();
	ОграничениеСпискаДокументовПоТипу(Результат, ОграничениеТипа);
	
	Возврат Результат;

КонецФункции

#КонецОбласти 

#КонецОбласти
